//Задача 66: Задайте значения M и N. Напишите программу, которая найдёт 
//сумму натуральных элементов в промежутке от M до N.
//M = 1; N = 15 -> 120
//M = 4; N = 8. -> 30

Console.Write("Введите M: ");
int M = Convert.ToInt16(Console.ReadLine());

Console.Write("Введите N: ");
int N = Convert.ToInt16(Console.ReadLine());

Console.WriteLine(CalcSum(M, N));

int CalcSum(int m, int n)
		{
			int start = m;
			int end = n;
			if(m > n)
			{
				start = n;
				end = m;
			}
			return (end + start)*(end - start + 1)/2; 
		}